Tutorials/2D/Ladenburg-medium/0.orig/alphaQGD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaQGD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.3;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.3;
    }
    
    outlet
    {
        type            calculated;
        value           uniform 0.3;
    }
    
    freestream
    {
        type            calculated;
        value           uniform 0.3;
    }
    
    freestreamInlet
    {
        type            calculated;
        value           uniform 0.3;
    }
    
    wedge1 {type wedge;}
    wedge2 {type wedge;}
}


// ************************************************************************* //
